[
    {
        "title": "Thunderbolts*",
        "rating": 7.7,
        "description": "Marvel Studios and a crew of indie veterans who sold out present \"Thunderbolts*,\" an irreverent team-up featuring depressed assassin Yelena Belova alongside the MCU's least anticipated band of misfits. The film stars Florence Pugh, Sebastian Stan, David Harbour, Wyatt Russell, Olga Kurylenko, Lewis Pullman, Geraldine Viswanathan, Chris Bauer, Wendell Edward Pierce, with David Harbour, with Hannah John-Kamen, and Julia Louis-Dreyfus. Jake Schreier directs \"Thunderbolts*\" and Kevin Feige is the producer. Louis D'Esposito, Brian Chapek and Jason Tamez serve as executive producers.",
        "runtime": 127,
        "imageName": "thunderbolts"
    },
    {
        "title": "A Minecraft Movie",
        "rating": 5.9,
        "description": "Welcome to the world of Minecraft, where creativity doesn't just help you craft, it's essential to one's survival! Four misfits—Garrett \"The Garbage Man\" Garrison (Momoa), Henry (Hansen), Natalie (Myers) and Dawn (Brooks)—find themselves struggling with ordinary problems when they are suddenly pulled through a mysterious portal into the Overworld: a bizarre, cubic wonderland that thrives on imagination. To get back home, they'll have to master this world (and protect it from evil things like Piglins and Zombies, too) while embarking on a magical quest with an unexpected, expert crafter, Steve (Black). Together, their adventure will challenge all five to be bold and to reconnect with the qualities that make each of them uniquely creative…the very skills they need to thrive back in the real world.",
        "runtime": 101,
        "imageName": "minecraft"
    },
    {
        "title": "The Accountant 2",
        "rating": 7.1,
        "description": "Christian Wolff (Ben Affleck) has a talent for solving complex problems. When an old acquaintance is murdered, leaving behind a cryptic message to \"find the accountant,\" Wolff is compelled to solve the case. Realizing more extreme measures are necessary, Wolff recruits his estranged and highly lethal brother, Brax (Jon Bernthal), to help. In partnership with U.S. Treasury Deputy Director Marybeth Medina (Cynthia Addai-Robinson), they uncover a deadly conspiracy, becoming targets of a ruthless network of killers who will stop at nothing to keep their secrets buried.",
        "runtime": 133,
        "imageName": "accountant"
    },
    {
        "title": "Sinners",
        "rating": 8.1,
        "description": "Trying to leave their troubled lives behind, twin brothers (Jordan) return to their hometown to start again, only to discover that an even greater evil is waiting to welcome them back.",
        "runtime": 138,
        "imageName": "sinners"
    },
    {
        "title": "Until Dawn",
        "rating": 6,
        "description": "One year after her sister Melanie mysteriously disappeared, Clover and her friends head into the remote valley where she vanished in search of answers. Exploring an abandoned visitor center, they find themselves stalked by a masked killer and horrifically murdered one by one… only to wake up and find themselves back at the beginning of the same evening. Trapped in the valley, they're forced to relive the night again and again - only each time the killer threat is different, each more terrifying than the last. Hope dwindling, the group soon realizes they have a limited number of deaths left, and the only way to escape is to survive until dawn.",
        "runtime": 103,
        "imageName": "dawn"
    },
    {
        "title": "Dog Man",
        "rating": 6.3,
        "description": "From DreamWorks Animation—creators of the beloved blockbuster franchises Kung Fu Panda, How to Train Your Dragon and The Boss Baby—comes the canine-crime-fighting film adaptation of Dav Pilkey's New York Times bestselling literary phenomenon: Dog Man. When a faithful police dog and his human police officer owner are injured together on the job, a harebrained but life-saving surgery fuses the two of them together and Dog Man is born. Dog Man is sworn to protect and serve—and fetch, sit and roll over. As Dog Man embraces his new identity and strives to impress his Chief (Lil Rel Howery, Get Out, Free Guy), he must stop the pretty evil plots of feline supervillain Petey the Cat (Pete Davidson; Saturday Night Live, The King of Staten Island). Petey's latest plan is to clone himself, creating the kitten Lil Petey, to double his ability to do crime stuff. Things get complicated, though, when Lil Petey forges an unexpected bond with Dog Man. When Lil Petey falls into the clutches of a common enemy, Dog Man and Petey reluctantly join forces in an action-packed race against time to rescue the young kitten. In the process, they discover the power of family (and kittens!) to bring even the most hostile foes together. Dog Man also stars Isla Fisher (Wedding Crashers, Rango) as TV reporter Sarah Hatoff; Poppy Liu (Hacks, The Afterparty) as Petey's assistant, Butler; Emmy nominee Stephen Root (Barry, King of the Hill) as Grampa; Billy Boyd (the Lord of the Rings franchise, Seed of Chucky) as Sarah's cameraman, Seamus; and Emmy and Golden Globe winner Ricky Gervais (The Office, Extras) as Flippy the fish. Dog Man is directed by Emmy winner Peter Hastings (The Epic Tales of Captain Underpants, Kung Fu Panda: Legends of Awesomeness), whose credits include the groundbreaking animated series Animaniacs and Pinky and the Brain. The film is produced by Karen Foster (Spirit Untamed), who served as co-producer on DreamWorks Animation's How to Train Your Dragon. Launched in 2016 by Dav Pilkey—the #1 global bestselling author and award-winning illustrator of the Captain Underpants books—the Dog Man Scholastic series now includes 12 books. The series has more than 60 million copies in print and has been translated into 45 languages. Cat Kid Comic Club, a spin-off of Dog Man launched in 2020, has also topped bestseller lists around the world. The most recent Dog Man book, Dog Man: Twenty Thousand Fleas Under the Sea, was overall the #1 bestselling children's book in the U.S. in 2023, across all children's formats and ages. Pilkey's newest book in the Dog Man Series, Dog Man: Big Jim Begins, is set to release on December 3, 2024.",
        "runtime": 95,
        "imageName": "dogman"
    },
    {
        "title": "Warfare",
        "rating": 7.8,
        "description": "A platoon of Navy SEALs embark on a dangerous mission in Ramadi, Iraq, with the chaos and brotherhood of war retold through their memories of the event.",
        "runtime": 95,
        "imageName": "warfare"
    },
    {
        "title": "The Amateur",
        "rating": 6.7,
        "description": "Charlie Heller (Malek) is a brilliant, but deeply introverted decoder for the CIA working out of a basement office at headquarters in Langley whose life is turned upside down when his wife is killed in a London terrorist attack. When his supervisors refuse to take action, he takes matters into his own hands, embarking on a dangerous trek across the globe to track down those responsible, his intelligence serving as the ultimate weapon for eluding his pursuers and achieving his revenge. \"The Amateur\" opens in Cinemas on Thursday, 10th April, 2025.",
        "runtime": 123,
        "imageName": "amateur"
    },
    {
        "title": "Snow White",
        "rating": 1.6,
        "description": "\"Disney's Snow White\" is a live-action musical reimagining of the classic 1937 film. The magical music adventure journeys back to the timeless story with beloved characters Bashful, Doc, Dopey, Grumpy, Happy, Sleepy, and Sneezy. \"Disney's Snow White\" is directed by Marc Webb and produced by Marc Platt and Jared LeBoff, with Callum McDougall serving as executive producer, and features all-new original songs from Benj Pasek and Justin Paul.",
        "runtime": 109,
        "imageName": "snowwhite"
    },
    {
        "title": "Drop",
        "rating": 6.2,
        "description": "A widowed mother's first date in years takes a terrifying turn when she's bombarded with anonymous threatening messages on her phone during their upscale dinner, leaving her questioning if her charming date is behind the harassment.",
        "runtime": 95,
        "imageName": "drop"
    }
]
